## sso_proxy
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 3 to add, 0 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_cluster.pomerium_sso_proxy will be destroyed
  # (because aws_ecs_cluster.pomerium_sso_proxy is not in configuration)
  - resource "aws_ecs_cluster" "pomerium_sso_proxy" {
      - arn                = "arn:aws:ecs:ca-central-1:794722365809:cluster/pomerium_sso_proxy" -> null
      - capacity_providers = [] -> null
      - id                 = "arn:aws:ecs:ca-central-1:794722365809:cluster/pomerium_sso_proxy" -> null
      - name               = "pomerium_sso_proxy" -> null
      - tags               = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-sso-proxy"
          - "Terraform"  = "true"
        } -> null
      - tags_all           = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-sso-proxy"
          - "Terraform"  = "true"
        } -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # aws_ecs_cluster.pomerium_sso_proxy_auth will be destroyed
  # (because aws_ecs_cluster.pomerium_sso_proxy_auth is not in configuration)
  - resource "aws_ecs_cluster" "pomerium_sso_proxy_auth" {
      - arn                = "arn:aws:ecs:ca-central-1:794722365809:cluster/pomerium_sso_proxy_auth" -> null
      - capacity_providers = [] -> null
      - id                 = "arn:aws:ecs:ca-central-1:794722365809:cluster/pomerium_sso_proxy_auth" -> null
      - name               = "pomerium_sso_proxy_auth" -> null
      - tags               = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-sso-proxy"
          - "Terraform"  = "true"
        } -> null
      - tags_all           = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-sso-proxy"
          - "Terraform"  = "true"
        } -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # aws_ecs_cluster.sso_proxy will be created
  + resource "aws_ecs_cluster" "sso_proxy" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "sso_proxy"
      + tags               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-sso-proxy"
          + "Terraform"  = "true"
        }
      + tags_all           = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-sso-proxy"
          + "Terraform"  = "true"
        }

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.pomerium_sso_proxy must be replaced
-/+ resource "aws_ecs_service" "pomerium_sso_proxy" {
      ~ cluster                            = "arn:aws:ecs:ca-central-1:794722365809:cluster/pomerium_sso_proxy" -> (known after apply) # forces replacement
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/pomerium_sso_proxy/pomerium_sso_proxy" -> (known after apply)
        name                               = "pomerium_sso_proxy"
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
        # (11 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }


        # (2 unchanged blocks hidden)
    }

  # aws_ecs_service.pomerium_sso_proxy_auth must be replaced
-/+ resource "aws_ecs_service" "pomerium_sso_proxy_auth" {
      ~ cluster                            = "arn:aws:ecs:ca-central-1:794722365809:cluster/pomerium_sso_proxy_auth" -> (known after apply) # forces replacement
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/pomerium_sso_proxy_auth/pomerium_sso_proxy_auth" -> (known after apply)
        name                               = "pomerium_sso_proxy_auth"
      ~ platform_version                   = "LATEST" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }


      ~ service_registries {
          - container_port = 0 -> null
          - port           = 0 -> null
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

Plan: 3 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
